class Lexicon:
    questionnaire = 'アンケート'
    question = '質問'

    q_age = "年齢を半角数字で入力してください。"

    q_gender = "性別（ジェンダー）を選択してください。"
    q_gender_opts =[
        [1, '男性'],
        [2, '女性'],
    ]
    q_affiliate = "あなたの所属を選択してください"
    q_affiliate_opts =[
        [1, '文学部'],
        [2, '人間科学部'],
        [3, '外国語学部'],
        [4, '法学部'],
        [5, '経済学部'],
        [6, '理学部'],
        [7, '医学部'],
        [8, '歯学部'],
        [9, '薬学部'],
        [10, '工学部'],
        [11, '基礎工学部'],

        [12, '人文学研究科'],
        [13, '人間科学研究科'],
        [14, '法学研究科'],
        [15, '経済学研究科'],
        [16, '理学研究科'],
        [17, '医学系研究科'],
        [18, '歯学研究科'],
        [19, '薬学研究科'],
        [20, '工学研究科'],
        [21, '基礎工学研究科'],
        [22, '国際公共政策研究科'],
        [23, '情報科学研究科'],
        [24, '生命機能研究科'],
        [25, '高等司法研究科'],
    ]

    q_rule = "本実験のルールは理解しやすかったですか？"
    q_rule_opts =[
        [1, 'とてもそう思う'],
        [2, 'そう思う'],
        [3, 'どちらともいえない'],
        [4, 'そう思わない']
    ]

    q_offer_1 = "提案を出すときに、相手の得点（利益）を考慮しましたか？"
    q_offer_1_opts =[
        [1, 'とてもそう思う'],
        [2, 'そう思う'],
        [3, 'どちらともいえない'],
        [4, 'そう思わない']
    ]

    q_offer_2 = "相手から非常に不公平なオファーを提示されたとき、腹が立ちましたか？"
    q_offer_2_opts =[
        [1, 'とてもそう思う'],
        [2, 'そう思う'],
        [3, 'どちらともいえない'],
        [4, 'そう思わない']
    ]








